# GBXMLExport Options Export Energy Model Type Property

Source: https://www.revitapidocs.com/2026/e0b8443f-e415-271a-5c9f-3c99cca13406.htm

---

| GBXMLExport Options Export Energy Model Type Property |
| --- |

**Note: This API is now obsolete.**

The energy model type from which gbXML will be exported.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")]
public ExportEnergyModelType ExportEnergyModelType { get; set; }
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")>
Public Property ExportEnergyModelType As ExportEnergyModelType
	Get
	Set
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")]
property ExportEnergyModelType ExportEnergyModelType {
	ExportEnergyModelType get ();
	void set (ExportEnergyModelType value);
}
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit.")>]
member ExportEnergyModelType : ExportEnergyModelType with get, set
```

#### Property Value

ExportEnergyModelType Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

Remarks Default value is AnalysisMode. See Also

#### Reference

GBXMLExportOptions Class Autodesk.Revit.DB Namespace